IDEA Open Model
CrossSectionGeneralColdFormed.Centerline Property
Compatible with IDEA StatiCa v 10.1
 Centerline of cross-section made from linear segments
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public PolyLine2D Centerline { get; set; }
Public Property Centerline As PolyLine2D
	Get
	Set
public:
property PolyLine2D^ Centerline {
	PolyLine2D^ get ();
	void set (PolyLine2D^ value);
}
Property Value
Type: PolyLine2D
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace